test/fixtures/checkouts.json

{
    "checkouts": [
        {
            "id": 1173093777450,
            "token": "123",
            "cart_token": "123",
            "email": "bob.mctest@test.com",
            "gateway": null,
            "buyer_accepts_marketing": false,
            "created_at": "2018-03-19T23:07:21-04:00",
            "updated_at": "2018-03-19T23:08:30-04:00",
            "landing_site": "/admin?login_token=123-123",
            "note": null,
            "note_attributes": [],
            "referring_site": "https://partners.shopify.com/123/stores/123",
            "shipping_lines": [
                {
                    "applied_discounts": [],
                    "code": "Standard Shipping",
                    "price": "10.0",
                    "markup": "0.0",
                    "source": "shopify",
                    "title": "Standard Shipping",
                    "phone": null,
                    "delivery_category": null,
                    "carrier_identifier": null,
                    "carrier_service_id": null,
                    "api_client_id": null,
                    "requested_fulfillment_service_id": null,
                    "tax_lines": [],
                    "custom_tax_lines": null,
                    "validation_context": null,
                    "id": "5b030d0f232c3d3f0f144467e3733bff"
                }
            ],
            "subtotal_price": "1244",
            "taxes_included": false,
            "total_discounts": "0",
            "total_line_items_price": "1244",
            "total_price": "1354",
            "total_tax": "100.00",
            "total_weight": 0,
            "currency": "JPY",
            "completed_at": null,
            "closed_at": null,
            "user_id": null,
            "location_id": null,
            "source_identifier": null,
            "source_url": null,
            "device_id": null,
            "phone": null,
            "customer_locale": "en",
            "line_items": [
                {
                    "applied_discounts": [],
                    "key": "123",
                    "compare_at_price": null,
                    "destination_location_id": 361887531050,
                    "fulfillment_service": "manual",
                    "gift_card": false,
                    "grams": 0,
                    "line_price": "10",
                    "origin_location_id": 154519339050,
                    "price": "10",
                    "product_id": 1335985537066,
                    "properties": null,
                    "quantity": 1,
                    "requires_shipping": true,
                    "sku": "123",
                    "tax_lines": [
                        {
                            "price": "1.00",
                            "title": "CT",
                            "rate": 0.08,
                            "zone": "country",
                            "source": "Shopify",
                            "compare_at": 0.08,
                            "position": 1
                        }
                    ],
                    "taxable": true,
                    "title": "Fancy Shirt",
                    "variant_id": 12293069373482,
                    "variant_title": "",
                    "vendor": "Fancy Vendor"
                },
                {
                    "applied_discounts": [],
                    "key": "123",
                    "compare_at_price": null,
                    "destination_location_id": 361887531050,
                    "fulfillment_service": "manual",
                    "gift_card": false,
                    "grams": 0,
                    "line_price": "1234",
                    "origin_location_id": 154519339050,
                    "price": "1234",
                    "product_id": 592509272106,
                    "properties": null,
                    "quantity": 1,
                    "requires_shipping": true,
                    "sku": "IPOD2008PINK",
                    "tax_lines": [
                        {
                            "price": "99.00",
                            "title": "CT",
                            "rate": 0.08,
                            "zone": "country",
                            "source": "Shopify",
                            "compare_at": 0.08,
                            "position": 1
                        }
                    ],
                    "taxable": true,
                    "title": "Another Awesome Product!",
                    "variant_id": 12322314321962,
                    "variant_title": "",
                    "vendor": "Another Awesome Teststore"
                }
            ],
            "name": "#1173093777450",
            "source": null,
            "discount_codes": [],
            "abandoned_checkout_url": "https://checkout.shopify.com/1234/checkouts/asdfasdfasdf/recover?key=asdfasdfads",
            "tax_lines": [
                {
                    "title": "CT",
                    "price": "100.00",
                    "rate": 0.08
                }
            ],
            "source_name": "web",
            "shipping_address": {
                "first_name": "Bob",
                "address1": "Ogi",
                "phone": null,
                "city": "Adachi",
                "zip": "123-0873",
                "province": "Tōkyō",
                "country": "Japan",
                "last_name": "McTest",
                "address2": "123",
                "company": null,
                "latitude": 35.7659235,
                "longitude": 139.7759151,
                "name": "Bob McTest",
                "country_code": "JP",
                "province_code": "JP-13"
            },
            "customer": {
                "id": 517303009322,
                "email": "bob.mctest@test.com",
                "accepts_marketing": false,
                "created_at": "2018-03-19T23:08:01-04:00",
                "updated_at": "2018-03-19T23:08:01-04:00",
                "first_name": "Bob",
                "last_name": "McTest",
                "orders_count": 0,
                "state": "disabled",
                "total_spent": "0.00",
                "last_order_id": null,
                "note": null,
                "verified_email": true,
                "multipass_identifier": null,
                "tax_exempt": false,
                "phone": null,
                "tags": "",
                "last_order_name": null,
                "default_address": {
                    "id": 571170422826,
                    "customer_id": 517303009322,
                    "first_name": "Bob",
                    "last_name": "McTest",
                    "company": null,
                    "address1": "Ogi",
                    "address2": "123",
                    "city": "Adachi",
                    "province": "Tōkyō",
                    "country": "Japan",
                    "zip": "123-0873",
                    "phone": null,
                    "name": "Bob McTest",
                    "province_code": "JP-13",
                    "country_code": "JP",
                    "country_name": "Japan",
                    "default": true
                }
            }
        }
    ]
}
